Revit 2024 API
GeometryInstance.GetSymbolGeometryId Method
Gets the SymbolGeometryId that contains data about the symbol of this instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public SymbolGeometryId GetSymbolGeometryId()
Visual Basic
Public Function GetSymbolGeometryId As SymbolGeometryId
Visual C++
public:
SymbolGeometryId^ GetSymbolGeometryId()
Return Value
Returns the SymbolGeometryId that contains data about the symbol of this instance.
Remarks
Use the strings returned by SymbolGeometryId.AsIdentifier(bool) to check if two GeometryInstance point to the same geometry of the symbol.
See Also
GeometryInstance Class
Autodesk.Revit.DB Namespace